print("Привіт! Ласкаво просимо до вікторини!")
print("Відповідай на питання правельно. Удачі!\n")

score = 0
total_questions = 10

answer1 = input("\n1. Столиця України? ")
if answer1 == "київ":
    print("Правильно! Молодець!")
    score += 1
else:
    print("Неправильно. Спробуйте ще раз!")

print("\n2. Який колір має небо вдень?")
print("а) Зелений\nб) Синій\nв) Червоний\nг) Жовтий")
answer2 = input("Введи правильний варіант (а/б/в/г): ")
if answer2 == "б":
    print("Правильно! Молодець!")
    score += 1
else:
    print("Неправильно. Спробуйте ще раз!")

answer3 = input("\n3. Скільки буде 2 + 2? ")
if answer3 == "4":
    print("Правильно! Молодець!")
    score += 1
else:
    print("Неправильно. Спробуйте ще раз!")

print("\n4. Яка тварина гавкає?")
print("а) Пес\nб) Кіт\nв) Корова\nг) Хом'як")
answer4 = input("Введи правильний варіант (а/б/в/г): ")
if answer4 == "а":
    print("Правильно! Молодець!")
    score += 1
else:
    print("Неправильно. Спробуйте ще раз!")

answer5 = input("\n5. Яка найвища гора у світі? ")
if answer5 == "еверест":
    print("Правильно! Молодець!")
    score += 1
else:
    print("Неправильно. Спробуйте ще раз!")

print("\n6. Який результат множення 3 * 3?")
print("а) 6\nб) 3\nв) 12\nг) 9")
answer6 = input("Введи правильний варіант (а/б/в/г): ")
if answer6 == "г":
    print("Правильно! Молодець!")
    score += 1
else:
    print("Неправильно. Спробуйте ще раз!")

answer7 = input("\n7. Який місяць іде після січня? ")
if answer7 == "лютий":
    print("Правильно! Молодець!")
    score += 1
else:
    print("Неправильно. Спробуйте ще раз!")

print("\n8. Який океан найбільший?")
print("а) Атлантичний\nб) Індійський\nв) Тихий\nг) Північний Льодовитий")
answer8 = input("Введи правильний варіант (а/б/в/г): ")
if answer8 == "в":
    print("Правильно! Молодець!")
    score += 1
else:
    print("Неправильно. Спробуйте ще раз!")

answer9 = input("\n9. Яка найвища гора в Україні? ")
if answer9 == "говерла":
    print("Правильно! Молодець!")
    score += 1
else:
    print("Неправильно. Спробуйте ще раз!")

print("\n10. Яка тварина найбільша на планеті?")
print("а) Слон\nб) Кит\nв) Носоріг\nг) Жираф")
answer10 = input("Введи правильний варіант (а/б/в/г): ")
if answer10 == "б":
    print("Правильно! Молодець!")
    score += 1
else:
    print("Неправильно. Спробуйте ще раз!")

print(f"\nГра завершена! Ви відповіли правильно на {score} з {total_questions} питань.")
